# frozen_string_literal: true
# Включает заморозку строковых литералов, что может улучшить производительность и избежать непреднамеренных изменений строк.

source 'https://rubygems.org'
# Указывает источник для загрузки гемов (библиотек) — в данном случае это RubyGems.

gem 'rspec'
# Добавляет гем RSpec, который используется для тестирования кода на Ruby.

gem 'rubocop', require: false
# Добавляет гем RuboCop, который используется для статического анализа кода.
# Параметр require: false означает, что RuboCop не будет автоматически загружаться при запуске приложения.
